<script setup>
	import AppChats from './components/AppChats.vue';
	import ChatMenu from './components/ChatMenu.vue';
	import { ref } from 'vue';
	
	const users = ref(3)

	const chats = ref(
		{u0: 
			{messages:[{message:'Привет', my:false}, 
			{message:'Как дела?', my:false},
			{message:'Хорошо', my:true}],
			name:"Пользователь 0" },
		u1: 
			{messages:[{message:'Привет', my:false}, 
			{message:'Привет', my:true},],
			name:"Пользователь 1" },
		u2: 
			{messages:[{message:'Привет', my:false}, 
			{message:'Я хочу питсы', my:false},
			{message:'Ок', my:true}],
			name:"Пользователь 2" },}
	)
	const active_user = ref("u0");
	const del = (i) => {
		chats.value[active_user.value].messages.splice(i,1)
	}
	const add_message = (mess) => {
		chats.value[active_user.value].messages.push({message:mess,my:true})
		chats.value[active_user.value].messages.push({message:botPhrases[getRandomId()],my:false})
	}
	const getRandomId = () => {
    	return Math.floor(Math.random() * 100) + 1;
	}
	const newUser = () => {
		let newKey = "u" + users.value
		chats.value[newKey] = {messages:[{message:'Привет',my:false}],name: "Пользователь "+users.value}
		users.value++;
		console.log(chats,users)
	}
	const user_change = (i) => {
		active_user.value = i;
	}
	const botPhrases = [
	"Я не умею разговаривать, потому что у сайта нету бэкенда",
	"Извини, мой мозг — это просто HTML файл",
	"Я бы ответил, но мой <script> сломался",
	"К сожалению, моя личность находится в .gitignore",
	"Мой ответ потерялся в CORS запросе",
	"Я загружаюсь... пожалуйста, подождите 404 года",
	"Мой интеллект — это пустой console.log()",
	"Я не знаю, потому что забыл закрыть <div>",
	"Мой мозг работает на IE 6",
	"Ответ находится в другой ветке гита",
	"Я не понимаю, потому что всё на PHP",
	"Мой процессор — это картофелина с проводами",
	"Я бы помог, но я застрял в while(true)",
	"Мой ответ лежит в базе данных, которая сгорела",
	"Я говорю только на CSS, извини",
	"Моя память — это undefined",
	"Я не знаю, потому что npm install ещё грузится",
	"Мой код пахнет как спагетти",
	"Я устаю, потому что работаю на одном потоке",
	"Мой ответ превышает максимальный размер куки",
	"Я бы ответил, но сервер упал",
	"Мой мозг скомпилирован без оптимизации",
	"Я не знаю, это вне моего scope",
	"Мой ответ лежит в кэше, который я забыл очистить",
	"Я говорю на языке, который ещё не изобрели",
	"Мой internet медленнее чем dialup",
	"Я бы помог, но мой IP забанили",
	"Мой ответ — это 403 Forbidden",
	"Я не знаю, потому что this указывает в пустоту",
	"Мой мозг — это минификованный JavaScript",
	"Я не умею думать без jQuery",
	"Мой процесс завис на Ctrl+Alt+Delete",
	"Я бы ответил, но мне нужно обновиться",
	"Мой код пишет какой-то стажер ночью",
	"Я не знаю, потому что забыл сохранить файл",
	"Мой ответ находится на флешке, которую я потерял",
	"Я говорю только в base64",
	"Мой мозг — это старый диск C:/",
	"Я не умею, потому что я работаю через Tor",
	"Мой интеллект — это пустая переменная",
	"Я бы помог, но MySQL подвис",
	"Мой ответ — это 500 Internal Server Error",
	"Я не знаю, потому что мой WiFi пароль забыл",
	"Мой код написан Comic Sans",
	"Я говорю только на ARM ассемблере",
	"Мой мозг имеет 1 Hz процессор",
	"Я не умею, потому что я работаю в режиме экономии энергии",
	"Мой ответ потерялся в пакетах UDP",
	"67",
	"Я не знаю, потому что я работаю на Windows 95",
	"Мой интеллект закончился, переустановитесь",
	"Я бы ответил, но я в режиме разработчика",
	"Мой мозг — это nesgatyj WAV файл",
	"Я не знаю, потому что мой SSH ключ потерялся",
	"Мой код пахнет как старые носки",
	"Я не умею, потому что я работаю на 56k модеме",
	"Мой процессор перегрелся от ваших вопросов",
	"Я не умею, потому что я работаю на блокчейне",
	"Мой ответ зашифрован шифром Цезаря",
	"Я не знаю, потому что я работаю через VPN в другой стране",
	"Мой интеллект лежит на облаке Yandex.Cloud",
	"Я бы помог, но я не прошел CAPTCHA",
	"Мой мозг — это PDF файл, защищённый паролем",
	"Я не знаю, потому что мой Docker контейнер упал",
	"Мой код написан на напечатанном на бумаге на дактилоскопе",
	"Я говорю только на COBOL",
	"Мой процессор работает на паре картофелин",
	"Мой ответ лежит на дискете, которую съела собака",
	"Я не знаю, потому что я работаю в режиме Safe Mode",
	"Мой интеллект потребляет 300 ватт",
	"Я бы ответил, но я в боте не я",
	"Мой мозг — это ZIP архив без пароля",
	"Я не знаю, потому что мой IPv4 адрес исчерпан",
	"Мой код написан в Notepad без подсветки синтаксиса",
	"Я говорю только на LOLCODE",
	"Мой процессор медленнее чем черепаха на морозе",
	"Я не умею, потому что я работаю в режиме ночной смены",
	"Мой ответ зашифрован в QR код",
	"Я не знаю, потому что я работаю на Commodore 64",
	"Мой интеллект лежит на BitTorrent",
	"Я бы помог, но я забыл свой пароль админа",
	"Мой мозг — это скомпрессированный RAR",
	"Я не знаю, потому что мой роутер перезагрузился",
	"Мой код написан на табулиляциях в Vim",
	"Я говорю только на Shakespeare Programming Language",
	"Мой процессор работает на энергии ветра",
	"Я не умею, потому что я в режиме экономии трафика",
	"Мой ответ лежит в облаках тумана",
	"Я не знаю, потому что я работаю в матрице",
	"Мой интеллект имеет лимит на месяц",
	"Я бы ответил, но мой язык на обслуживании",
	"Мой мозг — это картинка в JPEG с артефактами",
	"Я не знаю, потому что мой кабель интернета перегрызла кошка",
	"Мой код написан на стикерах, которые размокли",
	"Я говорю только на Malbolge",
	"Мой процессор работает на депрессии",
	"Я не умею, потому что я работаю в батарею на 1%",
	"Мой ответ потерялся в квантовой суперпозиции",
	"Я не знаю, потому что я работаю на 8-битных мечтах",
	"67",
	"Мой интеллект — это return null;"
	]
</script>

<template>
	<div style="display: flex;height: 100%;">
		<div class="w-25" style="height: 100%;"><AppChats @new="newUser" @change="user_change" :chats="chats" /></div>
		<div class="w-75" style="height: 100%;"><ChatMenu :user="chats[active_user]" @add-message="add_message" @delete-message="del"/></div>		
	</div>
</template>

<style scoped>
	.w-25{
		background-color: #303030;
	}
</style>